test/performance_threadpool.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      500
Time taken for tests:   1.118 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      5120000 bytes
HTML transferred:       4085000 bytes
Requests per second:    4472.56 [#/sec] (mean)
Time per request:       111.793 [ms] (mean)
Time per request:       0.224 [ms] (mean, across all concurrent requests)
Transfer rate:          4472.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.0      0       8
Processing:     5  106  17.9    110     123
Waiting:        1  106  17.9    110     123
Total:         10  107  16.2    110     123

Percentage of the requests served within a certain time (ms)
  50%    110
  66%    112
  75%    114
  80%    115
  90%    116
  95%    117
  98%    118
  99%    119
 100%    123 (longest request)


-------------------------------------------------------------------


This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      500
Time taken for tests:   2.206 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      10240000 bytes
HTML transferred:       8170000 bytes
Requests per second:    4532.74 [#/sec] (mean)
Time per request:       110.308 [ms] (mean)
Time per request:       0.221 [ms] (mean, across all concurrent requests)
Transfer rate:          4532.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0       9
Processing:     8  107  28.5    109    1139
Waiting:        2  107  28.5    109    1139
Total:         11  108  28.0    109    1145

Percentage of the requests served within a certain time (ms)
  50%    109
  66%    111
  75%    113
  80%    114
  90%    115
  95%    117
  98%    119
  99%    120
 100%   1145 (longest request)

---------------------------------------------------------------------

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      500
Time taken for tests:   3.125 seconds
Complete requests:      15000
Failed requests:        0
Total transferred:      15360000 bytes
HTML transferred:       12255000 bytes
Requests per second:    4799.63 [#/sec] (mean)
Time per request:       104.175 [ms] (mean)
Time per request:       0.208 [ms] (mean, across all concurrent requests)
Transfer rate:          4799.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       9
Processing:     8  102  11.1    104     128
Waiting:        1  102  11.1    104     127
Total:         10  103  10.1    104     128

Percentage of the requests served within a certain time (ms)
  50%    104
  66%    105
  75%    107
  80%    108
  90%    110
  95%    112
  98%    116
  99%    118
 100%    128 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      500
Time taken for tests:   3.998 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      20480000 bytes
HTML transferred:       16340000 bytes
Requests per second:    5002.71 [#/sec] (mean)
Time per request:       99.946 [ms] (mean)
Time per request:       0.200 [ms] (mean, across all concurrent requests)
Transfer rate:          5002.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       9
Processing:     5   98  25.3     99    1113
Waiting:        1   98  25.3     99    1113
Total:         10   99  25.0     99    1113

Percentage of the requests served within a certain time (ms)
  50%     99
  66%    100
  75%    101
  80%    102
  90%    103
  95%    105
  98%    106
  99%    108
 100%   1113 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      500
Time taken for tests:   4.758 seconds
Complete requests:      25000
Failed requests:        0
Total transferred:      25600000 bytes
HTML transferred:       20425000 bytes
Requests per second:    5253.94 [#/sec] (mean)
Time per request:       95.167 [ms] (mean)
Time per request:       0.190 [ms] (mean, across all concurrent requests)
Transfer rate:          5253.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       9
Processing:     8   94   8.3     94     112
Waiting:        1   94   8.3     94     112
Total:         10   94   7.4     94     112

Percentage of the requests served within a certain time (ms)
  50%     94
  66%     96
  75%     97
  80%     98
  90%    100
  95%    103
  98%    106
  99%    107
 100%    112 (longest request)



-----------------------------------------------------------------------


This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      1000
Time taken for tests:   5.463 seconds
Complete requests:      25000
Failed requests:        0
Total transferred:      25600000 bytes
HTML transferred:       20425000 bytes
Requests per second:    4576.26 [#/sec] (mean)
Time per request:       218.519 [ms] (mean)
Time per request:       0.219 [ms] (mean, across all concurrent requests)
Transfer rate:          4576.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.0      0      19
Processing:    11  214  67.0    213    1267
Waiting:        2  214  67.0    213    1267
Total:         21  214  67.0    214    1282

Percentage of the requests served within a certain time (ms)
  50%    214
  66%    218
  75%    220
  80%    221
  90%    227
  95%    231
  98%    239
  99%    242
 100%   1282 (longest request)


-----------------------------------------------------------------------


This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      1001
Time taken for tests:   5.088 seconds
Complete requests:      25000
Failed requests:        0
Total transferred:      25600000 bytes
HTML transferred:       20425000 bytes
Requests per second:    4913.09 [#/sec] (mean)
Time per request:       203.741 [ms] (mean)
Time per request:       0.204 [ms] (mean, across all concurrent requests)
Transfer rate:          4913.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.1      0      20
Processing:    12  199  45.0    200    1235
Waiting:        1  199  45.0    200    1235
Total:         22  200  44.2    200    1248

Percentage of the requests served within a certain time (ms)
  50%    200
  66%    205
  75%    208
  80%    209
  90%    214
  95%    216
  98%    219
  99%    222
 100%   1248 (longest request)


-----------------------------------------------------------------------



This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/


Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      1015
Time taken for tests:   5.068 seconds
Complete requests:      25000
Failed requests:        0
Total transferred:      25600000 bytes
HTML transferred:       20425000 bytes
Requests per second:    4932.47 [#/sec] (mean)
Time per request:       205.779 [ms] (mean)
Time per request:       0.203 [ms] (mean, across all concurrent requests)
Transfer rate:          4932.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.3      0      20
Processing:    13  201  36.8    201    1241
Waiting:        1  201  36.8    201    1241
Total:         20  202  35.0    201    1241

Percentage of the requests served within a certain time (ms)
  50%    201
  66%    206
  75%    209
  80%    211
  90%    226
  95%    230
  98%    233
  99%    234
 100%   1241 (longest request)

-----------------------------------------------------------------------

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        817 bytes

Concurrency Level:      1000
Time taken for tests:   205.014 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      1024000000 bytes
HTML transferred:       817000000 bytes
Requests per second:    4877.71 [#/sec] (mean)
Time per request:       205.014 [ms] (mean)
Time per request:       0.205 [ms] (mean, across all concurrent requests)
Transfer rate:          4877.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      19
Processing:    10  205  15.6    202    1299
Waiting:        1  205  15.6    202    1299
Total:         21  205  15.5    202    1299

Percentage of the requests served within a certain time (ms)
  50%    202
  66%    206
  75%    209
  80%    212
  90%    219
  95%    226
  98%    235
  99%    242
 100%   1299 (longest request)