test/performance_threadpool.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        7985 bytes

Concurrency Level:      500
Time taken for tests:   1.593 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      81920000 bytes
HTML transferred:       79850000 bytes
Requests per second:    6279.21 [#/sec] (mean)
Time per request:       79.628 [ms] (mean)
Time per request:       0.159 [ms] (mean, across all concurrent requests)
Transfer rate:          50233.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.6      0      10
Processing:     6   72  71.0     67    1016
Waiting:        1   72  71.0     67    1016
Total:         11   72  70.9     67    1017

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     70
  75%     71
  80%     72
  90%     75
  95%     78
  98%     82
  99%     85
 100%   1017 (longest request)